Revit 2027 API
IFCOpeningDimensions(IFCAnyHandle) Constructor
 Creates opening dimensions with a specified handle. The opening handle.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCOpeningDimensions(
	IFCAnyHandle openingHandle
)
Public Sub New (
	openingHandle As IFCAnyHandle
)
public:
IFCOpeningDimensions(
	IFCAnyHandle^ openingHandle
)
new :
        openingHandle : IFCAnyHandle -> IFCOpeningDimensions
Parameters
openingHandle IFCAnyHandle
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCOpeningDimensions Class
IFCOpeningDimensions Overload
Autodesk.Revit.DB.IFC Namespace